# Application Entry Point Properties

Source: https://www.revitapidocs.com/2026/11b68f71-7191-61f6-fcd4-8236979986a6.htm

---

| Application Entry Point Properties |
| --- |

The ApplicationEntryPoint type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | AddinFolder | The full path to the Revit Macros module. |

Top See Also

#### Reference

ApplicationEntryPoint Class Autodesk.Revit.DB.Macros Namespace