# IFCHybrid Import Class

Source: https://www.revitapidocs.com/2026/7f0506a4-c093-7f4b-e2d0-07df141f4767.htm

---

| IFCHybrid Import Class |
| --- |

Driver for Performing Hybrid Imports. Inheritance Hierarchy System Object
Autodesk.Revit.DB.IFC IFCHybridImport

**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class IFCHybridImport : IDisposable
```

```
Public Class IFCHybridImport
	Implements IDisposable
```

```
public ref class IFCHybridImport : IDisposable
```

```
type IFCHybridImport =
    class
        interface IDisposable
    end
```
The IFCHybridImport type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | IFCHybridImport | Constructs a new IFCHybridImport instance for importing IFC via Hybrid method. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateMap |  |
|  | Dispose | Releases all resources used by the IFCHybridImport |
|  | GetIFCStepIdToElementIdMap | Retrieves the association between the original IFC STEP identifiers and the created or updated Elements. |
|  | ImportElements(Document, String) | **Obsolete.** Imports IFC Elements using AnyCAD. |
|  | ImportElements(Document, String, IFCHybridImportOptions) | Imports IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String) | **Obsolete.** Updates IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String, IFCHybridImportOptions) | Updates IFC Elements using AnyCAD. |

Top See Also

#### Reference

Autodesk.Revit.DB.IFC Namespace