# IFCHybrid Import Methods

Source: https://www.revitapidocs.com/2026/71a73672-5e62-889b-05be-8750f02c115f.htm

---

| IFCHybrid Import Methods |
| --- |

The IFCHybridImport type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateMap |  |
|  | Dispose |  |
|  | GetIFCStepIdToElementIdMap | Retrieves the association between the original IFC STEP identifiers and the created or updated Elements. |
|  | ImportElements(Document, String) | **Obsolete.** Imports IFC Elements using AnyCAD. |
|  | ImportElements(Document, String, IFCHybridImportOptions) | Imports IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String) | **Obsolete.** Updates IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String, IFCHybridImportOptions) | Updates IFC Elements using AnyCAD. |

Top See Also

#### Reference

IFCHybridImport Class Autodesk.Revit.DB.IFC Namespace