# IFCHybrid Import Options Methods

Source: https://www.revitapidocs.com/2026/1dce25f6-caca-fa57-e654-5794aa63801c.htm

---

| IFCHybrid Import Options Methods |
| --- |

The IFCHybridImportOptions type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create a IFCHybridImportOptions from an options string, or null if it isn't hybrid mode. |
|  | Dispose |  |
|  | ToString(IFCHybridImportOptions) | Converts the IFCHybridImportOptions class to a revit.ini\-compatible string. |

Top See Also

#### Reference

IFCHybridImportOptions Class Autodesk.Revit.DB.IFC Namespace