# Analytical Opening Properties

Source: https://www.revitapidocs.com/2026/bbcbb6e1-820d-6cc1-fb89-24d8eb6f6df5.htm

---

| Analytical Opening Properties |
| --- |

The AnalyticalOpening type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | PanelId | ElementId of the AnalyticalPanel parent. |

Top See Also

#### Reference

AnalyticalOpening Class Autodesk.Revit.DB.Structure Namespace