# Analytical Panel Properties

Source: https://www.revitapidocs.com/2026/15932aaf-ef43-aa5c-ebdf-34f753e7d8a7.htm

---

| Analytical Panel Properties |
| --- |

The AnalyticalPanel type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Thickness | Panel thickness, in the Revit default units. |

Top See Also

#### Reference

AnalyticalPanel Class Autodesk.Revit.DB.Structure Namespace