# Analytical Member Properties

Source: https://www.revitapidocs.com/2026/4fa1b559-e38b-031c-44ef-c98d9c05f62e.htm

---

| Analytical Member Properties |
| --- |

The AnalyticalMember type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CrossSectionRotation | This represents the cross\-section rotation, in radians. |
|  | SectionTypeId | The id of the type from the structural Family assigned to the Analytical Member. |
|  | StructuralSectionShape | The structural section shape of the Analytical Member. |

Top See Also

#### Reference

AnalyticalMember Class Autodesk.Revit.DB.Structure Namespace