# Analytical Surface Base Properties

Source: https://www.revitapidocs.com/2026/01111e24-6322-9724-8670-3250e48e7a47.htm

---

| Analytical Surface Base Properties |
| --- |

The AnalyticalSurfaceBase type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | SketchId | Sketch associated to this Revit element. |

Top See Also

#### Reference

AnalyticalSurfaceBase Class Autodesk.Revit.DB.Structure Namespace