# Analytical Surface Base Methods

Source: https://www.revitapidocs.com/2026/968273e6-0923-5e16-4c3d-229487514385.htm

---

| Analytical Surface Base Methods |
| --- |

The AnalyticalSurfaceBase type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetOuterContour | Returns the Curve Loop that defines the geometry of the Analytical Surface element. |
|  | IsOuterContourValid | Checks if contour is valid for this Analytical Surface. |
|  | SetOuterContour | Sets the Curve Loop that defines the geometry of the Analytical Surface element. |

Top See Also

#### Reference

AnalyticalSurfaceBase Class Autodesk.Revit.DB.Structure Namespace