# Bar Terminations Data Methods

Source: https://www.revitapidocs.com/2026/f150fadf-21a7-6e7b-9c76-4d7e15343cfb.htm

---

| Bar Terminations Data Methods |
| --- |

The BarTerminationsData type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | AsRebarShapeTerminationsData | Creates a new instance of RebarShapeTerminationsData from this. |
|  | Dispose |  |
|  | GetDocument | Gets the document containing the hook type ids, end treatment ids and crank type ids. |

Top See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace