# Rebar Shape Terminations Data Methods

Source: https://www.revitapidocs.com/2026/fecd7d21-9997-d213-7d3b-997594ce9e82.htm

---

| Rebar Shape Terminations Data Methods |
| --- |

The RebarShapeTerminationsData type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetDocument | Gets the document containing the end treatment ids. |

Top See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace