# Rebar Bending Detail Type Methods

Source: https://www.revitapidocs.com/2026/e870b7e5-0c67-4a37-326e-951cacb807e1.htm

---

| Rebar Bending Detail Type Methods |
| --- |

The RebarBendingDetailType type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateRealistic | Creates a new RebarBendingDetailType object for full representations. |
|  | CreateSchematic | Creates a new RebarBendingDetailType object for schematic representations. |

Top See Also

#### Reference

RebarBendingDetailType Class Autodesk.Revit.DB.Structure Namespace