# Rebar Free Form Creation Result Methods

Source: https://www.revitapidocs.com/2026/c85d458a-3c03-2a09-cd1e-2ce0a580dbd3.htm

---

| Rebar Free Form Creation Result Methods |
| --- |

The RebarFreeFormCreationResult type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

Top See Also

#### Reference

RebarFreeFormCreationResult Class Autodesk.Revit.DB.Structure Namespace