# System Zone Element Type Methods

Source: https://www.revitapidocs.com/2026/ba248b2a-5073-c9b3-9fbf-1de2f7918558.htm

---

| System Zone Element Type Methods |
| --- |

The SystemZoneElementType type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateSketchBased | Creates a new element type for sketch\-based system\-zone elements and adds it to the document. |
|  | CreateSpaceBased | Creates a new element type for space\-based system\-zone elements and adds it to the document. |

Top See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace