# Zone Methods

Source: https://www.revitapidocs.com/2026/109bfb4f-cb4e-42f5-6545-e1ec2b39c36f.htm

---

| Zone Methods |
| --- |

The Zone type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | AddSpaces | **Obsolete.** Add a set of existing spaces to Zone element. |
|  | CreateAreaBasedLoad | Creates a new instance of an area based load and adds it to the document. |
|  | GetDomainData | Gets the domain data for the zone. |
|  | RemoveSpaces | **Obsolete.** Remove a set of existing spaces to the current Zone element. |

Top See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace