# Arc Methods

Source: https://www.revitapidocs.com/2026/19c3ba08-5443-c9d4-3a3f-0e78901fe6d4.htm

---

| Arc Methods |
| --- |

The Arc type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create(XYZ, XYZ, XYZ) | Creates a new geometric arc object based on three points. |
|  | Create(Plane, Double, Double, Double) | Creates a new geometric arc object based on plane, radius, and angles. |
|  | Create(XYZ, Double, Double, Double, XYZ, XYZ) | Creates a new geometric arc object based on center, radius, unit vectors, and angles. |

Top See Also

#### Reference

Arc Class Autodesk.Revit.DB Namespace