# Browser Organization Properties

Source: https://www.revitapidocs.com/2026/8a2cf9bf-cb26-2766-8f87-7635ff82a5d3.htm

---

| Browser Organization Properties |
| --- |

The BrowserOrganization type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | SortingOrder | The sorting order if sorting of items is applicable in the browser. |
|  | SortingParameterId | **Obsolete.** The Id of the parameter used to determine the sorting order of items in the browser. |
|  | Type | Get BrowserOrganizationType. |

Top See Also

#### Reference

BrowserOrganization Class Autodesk.Revit.DB Namespace