# Curve Overlap Point Methods

Source: https://www.revitapidocs.com/2026/2c5bed8d-9151-f5c9-cb5e-0f088152d3eb.htm

---

| Curve Overlap Point Methods |
| --- |

The CurveOverlapPoint type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

Top See Also

#### Reference

CurveOverlapPoint Class Autodesk.Revit.DB Namespace