# Curve Intersect Result Methods

Source: https://www.revitapidocs.com/2026/926cafbc-a055-186d-5fcc-f04fd62750c2.htm

---

| Curve Intersect Result Methods |
| --- |

The CurveIntersectResult type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetOverlaps | Gets information about the points shared between the two curves. |

Top See Also

#### Reference

CurveIntersectResult Class Autodesk.Revit.DB Namespace