# Cylindrical Helix Methods

Source: https://www.revitapidocs.com/2026/e75f9df9-f221-b22e-f1ec-d0050d10686f.htm

---

| Cylindrical Helix Methods |
| --- |

The CylindricalHelix type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create a cylindrical helix. |

Top See Also

#### Reference

CylindricalHelix Class Autodesk.Revit.DB Namespace