# Design Option Methods

Source: https://www.revitapidocs.com/2026/d5625e29-6df9-bc6c-8b18-feaf968734d4.htm

---

| Design Option Methods |
| --- |

The DesignOption type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetActiveDesignOptionId | Gets the active design option id for the document. |

Top See Also

#### Reference

DesignOption Class Autodesk.Revit.DB Namespace