# Ellipse Methods

Source: https://www.revitapidocs.com/2026/1db81652-6f8e-3774-d3ab-ef88866a91b2.htm

---

| Ellipse Methods |
| --- |

The Ellipse type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateCurve | Creates a new geometric ellipse or elliptical arc object. |

Top See Also

#### Reference

Ellipse Class Autodesk.Revit.DB Namespace