# Extrusion Roof Properties

Source: https://www.revitapidocs.com/2026/51c8b2ea-b8c9-5aa1-ec03-3f76bdc4b2bc.htm

---

| Extrusion Roof Properties |
| --- |

The ExtrusionRoof type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof. |

Top See Also

#### Reference

ExtrusionRoof Class Autodesk.Revit.DB Namespace