# Extrusion Analyzer Methods

Source: https://www.revitapidocs.com/2026/428c1314-8e90-fd2e-973e-701288c71618.htm

---

| Extrusion Analyzer Methods |
| --- |

The ExtrusionAnalyzer type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CalculateFaceAlignment | Calculates the alignment status of each face of the solid. |
|  | Create | Creates an ExtrusionAnalyzer and computes and stores the Solid's shadow. |
|  | Dispose |  |
|  | GetExtrusionBase | Obtains the face that represents the base contour of the extrusion analysis. |

Top See Also

#### Reference

ExtrusionAnalyzer Class Autodesk.Revit.DB Namespace