# Filter Numeric Less Class

Source: https://www.revitapidocs.com/2026/fcdb6568-9715-4292-e903-c73c0b54dd67.htm

---

| Filter Numeric Less Class |
| --- |

Tests whether numeric values from the document are less than a certain value Inheritance Hierarchy System Object
Autodesk.Revit.DB FilterNumericRuleEvaluator
Autodesk.Revit.DB FilterNumericLess

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class FilterNumericLess : FilterNumericRuleEvaluator
```

```
Public Class FilterNumericLess
	Inherits FilterNumericRuleEvaluator
```

```
public ref class FilterNumericLess : public FilterNumericRuleEvaluator
```

```
type FilterNumericLess =
    class
        inherit FilterNumericRuleEvaluator
    end
```
The FilterNumericLess type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericLess | Constructs an instance of FilterNumericLess. |

Top Properties

|  | Name | Description |
| --- | --- | --- |

Top Methods

|  | Name | Description |
| --- | --- | --- |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace