# Filter Numeric Equals Class

Source: https://www.revitapidocs.com/2026/13cab7f3-d15d-adfd-ff43-c69a4863a636.htm

---

| Filter Numeric Equals Class |
| --- |

Tests whether numeric values from the document are equal to a certain value Inheritance Hierarchy System Object
Autodesk.Revit.DB FilterNumericRuleEvaluator
Autodesk.Revit.DB FilterNumericEquals

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class FilterNumericEquals : FilterNumericRuleEvaluator
```

```
Public Class FilterNumericEquals
	Inherits FilterNumericRuleEvaluator
```

```
public ref class FilterNumericEquals : public FilterNumericRuleEvaluator
```

```
type FilterNumericEquals =
    class
        inherit FilterNumericRuleEvaluator
    end
```
The FilterNumericEquals type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericEquals | Constructs an instance of FilterNumericEquals. |

Top Properties

|  | Name | Description |
| --- | --- | --- |

Top Methods

|  | Name | Description |
| --- | --- | --- |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace