# Floor Class

Source: https://www.revitapidocs.com/2026/96cc6685-003d-ff90-1c5b-c25a4830f0f7.htm

---

| Floor Class |
| --- |

An object that represents a Floor within the Autodesk Revit project. Inheritance Hierarchy System Object
Autodesk.Revit.DB Element
Autodesk.Revit.DB HostObject
Autodesk.Revit.DB CeilingAndFloor
Autodesk.Revit.DB Floor

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class Floor : CeilingAndFloor
```

```
Public Class Floor
	Inherits CeilingAndFloor
```

```
public ref class Floor : public CeilingAndFloor
```

```
type Floor =
    class
        inherit CeilingAndFloor
    end
```
The Floor type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | FloorType | Retrieves/sets an object that represents the type of the floor. |
|  | SketchId | Returns id of the sketch. |
|  | SpanDirectionAngle | Retrieve the span direction angle of the floor. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IList CurveLoop , ElementId, ElementId) |  |
|  | Create(Document, IList CurveLoop , ElementId, ElementId, Boolean, Line, Double) |  |
|  | GetDefaultFloorType | Returns id of default floor type. |
|  | GetNormalAtVerticalProjectionPoint | Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical  projection of an arbitrary point in project space. |
|  | GetSlabShapeEditor | Gets a SlabShapeEditor that can be used to add or modify points of this Floor. |
|  | GetSpanDirectionSymbolIds | Retrieves span direction symbol ElementIds. |
|  | GetVerticalProjectionPoint | Return a surface point on either the top or bottom face of a floor slab corresponding to the vertical projection of an arbitrary point in project space. |

Top Remarks This object derived from the Element base object and such supports all the
 methods of that object such as the ability to retrieve the parameters of that object. See Also

#### Reference

Autodesk.Revit.DB Namespace