# Folder Item Info Methods

Source: https://www.revitapidocs.com/2026/eaa536da-69b7-d96b-7ba7-03a943a0654d.htm

---

| Folder Item Info Methods |
| --- |

The FolderItemInfo type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetGroupingParameterIdPath | The parameter Id path used to determine the folder items in the browser. |

Top See Also

#### Reference

FolderItemInfo Class Autodesk.Revit.DB Namespace