# GBXMLExport Options Class

Source: https://www.revitapidocs.com/2026/abb350ef-a773-7b70-6881-166e6f3c0a56.htm

---

| GBXMLExport Options Class |
| --- |

Green Building XML Export options. Inheritance Hierarchy System Object
Autodesk.Revit.DB GBXMLExportOptions

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class GBXMLExportOptions : IDisposable
```

```
Public Class GBXMLExportOptions
	Implements IDisposable
```

```
public ref class GBXMLExportOptions : IDisposable
```

```
type GBXMLExportOptions =
    class
        interface IDisposable
    end
```
The GBXMLExportOptions type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | GBXMLExportOptions | Constructs a new instance of the options used to export a model in gbXML (Green Building XML) format. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | Encoding | **Obsolete.** The encoding options to go into the processing instruction for the exported gbXML file. |
|  | ExportAnalyticalSystems | **Obsolete.** Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment). |
|  | ExportEnergyModelType | **Obsolete.** The energy model type from which gbXML will be exported. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the GBXMLExportOptions |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace