# GBXMLExport Options Methods

Source: https://www.revitapidocs.com/2026/54ecedd9-9222-9aee-8fdd-110e6f0b54a8.htm

---

| GBXMLExport Options Methods |
| --- |

The GBXMLExportOptions type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

Top See Also

#### Reference

GBXMLExportOptions Class Autodesk.Revit.DB Namespace