# Hermite Spline Class

Source: https://www.revitapidocs.com/2026/6852ca4c-2fad-cda1-be75-54e712a39318.htm

---

| Hermite Spline Class |
| --- |

A Hermite spline. Inheritance Hierarchy System Object
Autodesk.Revit.DB APIObject
Autodesk.Revit.DB GeometryObject
Autodesk.Revit.DB Curve
Autodesk.Revit.DB HermiteSpline

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class HermiteSpline : Curve
```

```
Public Class HermiteSpline
	Inherits Curve
```

```
public ref class HermiteSpline : public Curve
```

```
type HermiteSpline =
    class
        inherit Curve
    end
```
The HermiteSpline type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ControlPoints | The control points of the Hermite spline. |
|  | IsPeriodic | Returns whether the Hermite spline is periodic or not. |
|  | Parameters | Returns the params of the Hermite spline. |
|  | Tangents | Returns the tangents of the Hermite spline. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create(IList XYZ , Boolean) |  |
|  | Create(IList XYZ , Boolean, HermiteSplineTangents) |  |

Top Remarks The Hermite spline lies in the plane defined by control points. See Also

#### Reference

Autodesk.Revit.DB Namespace