# Hermite Spline Methods

Source: https://www.revitapidocs.com/2026/7ef5ab3c-ec07-c0d3-ece3-6ab86617b799.htm

---

| Hermite Spline Methods |
| --- |

The HermiteSpline type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create(IList XYZ , Boolean) |  |
|  | Create(IList XYZ , Boolean, HermiteSplineTangents) |  |

Top See Also

#### Reference

HermiteSpline Class Autodesk.Revit.DB Namespace