# IFCCategory Template Properties

Source: https://www.revitapidocs.com/2026/b1f47ee3-78a9-b3ec-c554-dd7fe12a9c45.htm

---

| IFCCategory Template Properties |
| --- |

The IFCCategoryTemplate type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidCategoryMappingFile | Whether or not the category mapping file is valid. |

Top See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace