# IFCProperty Mapping Info Methods

Source: https://www.revitapidocs.com/2026/bc3a1f58-e942-07cc-207c-71aa9a90b123.htm

---

| IFCProperty Mapping Info Methods |
| --- |

The IFCPropertyMappingInfo type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsValidMappingInfo | Defines whether the mapping info contains meaningful data. |

Top See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace