# IFCProperty Set Mapping Info Methods

Source: https://www.revitapidocs.com/2026/563b86bc-2246-fe4f-9d94-74485e21dc2d.htm

---

| IFCProperty Set Mapping Info Methods |
| --- |

The IFCPropertySetMappingInfo type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

Top See Also

#### Reference

IFCPropertySetMappingInfo Class Autodesk.Revit.DB Namespace