# Image View Class

Source: https://www.revitapidocs.com/2026/d81ffc17-044c-2671-c2f1-374e1dd90c53.htm

---

| Image View Class |
| --- |

Class for ImageView views Inheritance Hierarchy System Object
Autodesk.Revit.DB Element
Autodesk.Revit.DB View
Autodesk.Revit.DB ViewDrafting
Autodesk.Revit.DB ImageView

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class ImageView : ViewDrafting
```

```
Public Class ImageView
	Inherits ViewDrafting
```

```
public ref class ImageView : public ViewDrafting
```

```
type ImageView =
    class
        inherit ViewDrafting
    end
```
The ImageView type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ImageInstanceId | Id of the image in the view. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create an ImageView containing an image imported from disk. |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace