# Image View Properties

Source: https://www.revitapidocs.com/2026/f39d24e6-95f7-126c-b05d-3a5b0743c72e.htm

---

| Image View Properties |
| --- |

The ImageView type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ImageInstanceId | Id of the image in the view. |

Top See Also

#### Reference

ImageView Class Autodesk.Revit.DB Namespace