# Line Methods

Source: https://www.revitapidocs.com/2026/154b23e2-9f1f-813b-df56-e7c1bb347711.htm

---

| Line Methods |
| --- |

The Line type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateBound | Creates a new instance of a bound linear curve. |
|  | CreateUnbound | Creates a new instance of an unbound linear curve. |

Top See Also

#### Reference

Line Class Autodesk.Revit.DB Namespace