# Nurb Spline Methods

Source: https://www.revitapidocs.com/2026/cfb90f78-dc27-a305-031d-5e4ffac8a9ce.htm

---

| Nurb Spline Methods |
| --- |

The NurbSpline type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new geometric NurbSpline object from a HermiteSpline. |
|  | CreateCurve(HermiteSpline) | Creates a new geometric Curve object by converting the given HermiteSpline.  The created curve may be a NURBSpline or a simpler curve such as line or arc. |
|  | CreateCurve(IList XYZ , IList Double ) |  |
|  | CreateCurve(Int32, IList Double , IList XYZ ) |  |
|  | CreateCurve(Int32, IList Double , IList XYZ , IList Double ) |  |
|  | SetControlPointsAndWeights |  |

Top See Also

#### Reference

NurbSpline Class Autodesk.Revit.DB Namespace