# Roof Base Properties

Source: https://www.revitapidocs.com/2026/78dfd771-9fc0-3fd7-a095-8c03e19f5d03.htm

---

| Roof Base Properties |
| --- |

The RoofBase type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | EaveCuts | Retrieve or set the EaveCutterType. |
|  | FasciaDepth | Retrieve or set the FasciaDepth. |
|  | RoofType | Retrieve or set the Type. |

Top See Also

#### Reference

RoofBase Class Autodesk.Revit.DB Namespace