# Toposolid Properties

Source: https://www.revitapidocs.com/2026/80fca4c0-5cba-5123-d399-062dc1498814.htm

---

| Toposolid Properties |
| --- |

The Toposolid type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | HostTopoId | The host Toposolid id of the current Toposolid subdivision.  If the object is not a Toposolid subdivision, hostTopoId will be InvalidElementId. |
|  | SketchId | Returns id of the sketch. |

Top See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace