# View Position Methods

Source: https://www.revitapidocs.com/2026/36c9bc55-fb79-ca57-f1d9-92bdfe8402c8.htm

---

| View Position Methods |
| --- |

The ViewPosition type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new view position element. |
|  | GetPlacedViewportIdsForViewPosition | Gets the placed viewport ids for the view position. |

Top See Also

#### Reference

ViewPosition Class Autodesk.Revit.DB Namespace