# View Plan Properties

Source: https://www.revitapidocs.com/2026/31015f55-79d5-9f58-7d8d-df79a498c917.htm

---

| View Plan Properties |
| --- |

The ViewPlan type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | AreaScheme | The area scheme. |

Top See Also

#### Reference

ViewPlan Class Autodesk.Revit.DB Namespace