# View Drafting Class

Source: https://www.revitapidocs.com/2026/d0876cac-a93b-b89c-fa30-bcc14ab9d7f0.htm

---

| View Drafting Class |
| --- |

ViewDrafting represents a drafting view within the model. Inheritance Hierarchy System Object
Autodesk.Revit.DB Element
Autodesk.Revit.DB View
Autodesk.Revit.DB ViewDrafting
Autodesk.Revit.DB ImageView

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class ViewDrafting : View
```

```
Public Class ViewDrafting
	Inherits View
```

```
public ref class ViewDrafting : public View
```

```
type ViewDrafting =
    class
        inherit View
    end
```
The ViewDrafting type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new ViewDrafting in the model. |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace