# View Position Properties

Source: https://www.revitapidocs.com/2026/8a9c7dd7-b616-c5f0-7d90-997fdcb6a789.htm

---

| View Position Properties |
| --- |

The ViewPosition type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Position | Specifies view's position. |
|  | ViewAnchor | Specifies the method by which the view will be positioned on the sheet. Default is set to ViewAnchor.ViewOrigin. |

Top See Also

#### Reference

ViewPosition Class Autodesk.Revit.DB Namespace