# Analytical Transfer Switch Data Properties

Source: https://www.revitapidocs.com/2026/c9e02db0-92a5-f7e4-a717-9eb3cca40f9c.htm

---

| Analytical Transfer Switch Data Properties |
| --- |

The AnalyticalTransferSwitchData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurrentRating | The current rating value of the electrical analytical transfer switch. |
|  | TotalConnectedCurrent | The total connected current of the electrical analytical transfer switch. |

Top See Also

#### Reference

AnalyticalTransferSwitchData Class Autodesk.Revit.DB.Electrical Namespace