# Analytical Power Source Data Properties

Source: https://www.revitapidocs.com/2026/327ffde9-a930-e012-d51d-a1c3ae3fb75b.htm

---

| Analytical Power Source Data Properties |
| --- |

The AnalyticalPowerSourceData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ApparentPowerRating | The apparent power rating value of the analytical power source. |
|  | TotalConnectedCurrent | The total connected current of the analytical power source. |

Top See Also

#### Reference

AnalyticalPowerSourceData Class Autodesk.Revit.DB.Electrical Namespace