# Analytical Bus Data Properties

Source: https://www.revitapidocs.com/2026/fee25520-ec7a-a377-1973-d3a7b9b78d55.htm

---

| Analytical Bus Data Properties |
| --- |

The AnalyticalBusData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurrentRating | The current rating value of the analytical bus. |
|  | TotalConnectedCurrent | The total connected current of the analytical bus. |

Top See Also

#### Reference

AnalyticalBusData Class Autodesk.Revit.DB.Electrical Namespace