# Analytical Transformer Data Properties

Source: https://www.revitapidocs.com/2026/31bd8492-f8f4-98f2-3a31-377acc8a15e4.htm

---

| Analytical Transformer Data Properties |
| --- |

The AnalyticalTransformerData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ApparentPowerRating | The apparent power rating value of the analytical transformer. |
|  | SecondaryDistributionSystem | The secondary distribution system of the analytical transformer. |

Top See Also

#### Reference

AnalyticalTransformerData Class Autodesk.Revit.DB.Electrical Namespace