# Cable Type Properties

Source: https://www.revitapidocs.com/2026/21a8b331-4660-7946-7f05-75def71f6f4b.htm

---

| Cable Type Properties |
| --- |

The CableType type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ConductorMaterial | The Conductor Material of this Cable Type. |
|  | CoreType | The core type of the cable type. |
|  | InsulationMaterial | The Conductor Insulation Material of this Cable Type. |
|  | TemperatureRating | The Conductor Temperature Rating of this Cable Type. |

Top See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace