# Ground Conductor Size Class

Source: https://www.revitapidocs.com/2026/922e6d1c-9bde-70c5-774b-a04a941003c1.htm

---

| Ground Conductor Size Class |
| --- |

**Note: This API is now obsolete.**

Represents electrical ground conductor size definition information. Inheritance Hierarchy System Object
Autodesk.Revit.DB APIObject
Autodesk.Revit.DB.Electrical GroundConductorSize

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")]
public class GroundConductorSize : APIObject
```

```
<ObsoleteAttribute("GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")>
Public Class GroundConductorSize
	Inherits APIObject
```

```
[ObsoleteAttribute(L"GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")]
public ref class GroundConductorSize : public APIObject
```

```
[<ObsoleteAttribute("GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")>]
type GroundConductorSize =
    class
        inherit APIObject
    end
```
The GroundConductorSize type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Ampacity | Get ampacity which is used for specifying size, the unit is ampere. |
|  | ConductorSize | Get conductor size corresponding to specific ampacity. |
|  | MaterialBelongTo | Get the material type which include this ground conductor size information. |

Top Methods

|  | Name | Description |
| --- | --- | --- |

Top Remarks Ground conductor size is defined based on corresponding wire material type. See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace