# Insulation Type Class

Source: https://www.revitapidocs.com/2026/3eacc872-bb46-73a5-9ae7-d309d1d3ad64.htm

---

| Insulation Type Class |
| --- |

**Note: This API is now obsolete.**

Represents electrical insulation type definition information. Inheritance Hierarchy System Object
Autodesk.Revit.DB Element
Autodesk.Revit.DB ElementType
Autodesk.Revit.DB.Electrical InsulationType

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")]
public class InsulationType : ElementType
```

```
<ObsoleteAttribute("InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")>
Public Class InsulationType
	Inherits ElementType
```

```
[ObsoleteAttribute(L"InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")]
public ref class InsulationType : public ElementType
```

```
[<ObsoleteAttribute("InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")>]
type InsulationType =
    class
        inherit ElementType
    end
```
The InsulationType type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsInUse | Indicate whether the insulation type is in use. |
|  | Name | Get name of Insulation type. (Overrides ElementType Name ) |

Top Methods

|  | Name | Description |
| --- | --- | --- |

Top Remarks Insulation type is defined based on corresponding wire material type and temperature rating type. See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace